// -*- C++ -*-
/*!
 * @file  RoboCar.cpp
 * @brief ModuleDescription
 * @date $Date$
 *
 * $Id$
 */

#include "RoboCar.h"  
#include "robocarDll.h"
#define STRICT

#include <tchar.h>
#include <windows.h>
#include <windowsx.h>
#include <basetsd.h>
#include <mmsystem.h>
#include <math.h>
#include <stdio.h>  
#include "resource.h"
#include "PCANBasic.h"
#include <iostream>

using namespace std;

//デバッグ用変数
int tmpA,tmpB,tmpC;
unsigned char tma,tmb,tmc,tmd,tme;

//CAN関係
HANDLE CAN1Thread, CAN2Thread;

FILE *fp;
int logcounter = 0;


//Prius CAN関係(プリウスから出力する)
struct Prius_CAN
{
	int Sideway_acceleration_sensor;	// -:左方向,+:右方向
	int Acceleration_sensor;			// -:手前方向,+:踏込方向
	int Steering_Angle;				// 
	int Brakes_Pressflg;				// bit#7 : 0=pressed 1=released  ( 0x84 Not pressed / 0x04 Pressed )
	int Brakes_Strength;				// 0:out, 0x7F:pushed in 
	int EM_Current1;					// 12 bit signed number ( + discharge ) unit is 0.1A
	int EM_Current2;					// battery pack voltage, unit is 1V
	int Front_Wheels_R;				// value is speed in km/h * 100
	int Front_Wheels_L;				// value is speed in km/h * 100
	int Rear_Wheels_R;				// value is speed in km/h * 100
	int Rear_Wheels_L;				// value is speed in km/h * 100
	int Speed;						// 0x400 for every 10km/h, including signed value for backwards
	int Drive_Mode_Cruiseflg;			// 0x50=D 0x51=B 0x4D=P 0x4E=R 0x4F=N MSB=CruiseON/off 0x49|0x4B = Standby
	int Drive_Mode_Shiftflg;			// 0x13&0x14=D 0x10=P 0x11=R 0x12=N
	int Drive_Mode_Powerflg;			// 0x04=Powered 0x00=Standby
	int Gas_Pedal_Speed;				// Speed related ( ~0x150=10km/h ~0x300=20km/h ~0x700=50km/h )  ALSO, negative, when backing up !!!
	int Gas_Pedal;					// Gas Pedal ( 0x00 ~ 0xC8 )
	int ICE_Throttle;					// Throttle related ( requested rpm ?) ~MPG=(KMH*10000)/value 
	int ICE_Powerflg;					// 0 when no power by ICE.
	int ICE_Rpm_Target;				// Target RPM ( unit is 32 rpm )
	int Speed2;						// Value in km/h
	int Battery_Max_Amps_Discharge;	// max current for the battery discharge in Amps.
	int Battery_Max_Amps_Charge;		// max current for the battery charge in Amps.
	int Battery_SOC;					// 16 bit = SOC Value, unit is 0.5%
	int Battery_Min_Temp;				// Batt Temp Min. (C)
	int Battery_Max_Temp;				// Batt Temp Max.
	int Battery_Fault_Code;
	int Battery_Pack_Voltage;			// 16 bit pack voltage
	int EV_MODE;						// 0x00=Normal Drive  0x40=EVMode  0x80=EVDenied  Other=Cancelled
	int Interlock;					// bit#7 pressed/depressed
	int Engine_Coolant_Temp;			// value in Celsius, unit is 0.5C
	int Shift_Lever;					// 00=B 10=D 20=N 40=R 80=P
	int Shift_Transition;				// bit#7 transition
	int Lights_Front;					// 00=Off 10=Park 30=On 38=HighBeam
	int Lights_Transition;			// bit#7 transition
	int Lights_Instruments;			// bit#3 instruments 1=dimmed 0=normal ( 0x18/0x10 )
	int Gas_Gauge;					// value ( my recorded max is 0x28 )
	int Doors_flg;					// 00=Closed 04=Rear 40=Passenger 80=Driver open
	int Doors_Transition;				// bit#7 transition
	int Cruise_flg;					// 00=Off 10=On
	int Cruise_Transition;			// bit#7 transition
}Prius;


//HV Controller受信関係(get"出力"、set"入力する")
struct HV_Controller_CAN_GET
{
	int Priority_Error_Level;
	int Priority_Error_Code;
	int Drive_Mode_Drive;			//0x00 マニュアルモード, 0x10 プログラムモード
	int Drive_Mode_Cont;			//0x00 速度制御, 0x10 ペダルストローク制御
	int Drive_Mode_Override;		//0x00 オーバーライドEnable, 0x10 オーバーライドDisable
	int Drive_Mode_Servo;			//0x00 サーボOFF, 0x10 サーボON
	int Drive_Pedal_Input;			//アクセル入力値 0〜4095 (0〜1.0)
	int Drive_Pedal_Target;			//アクセル指令値 0〜4095 (0〜1.0)
	int Drive_Pedal_Actual;			//アクセル現在値 0〜4095 (0〜1.0)
	int Drive_Shift_Input;			//シフト入力値 0x00 B, 0x10 D, 0x20 N, 0x40 R, 0x80 P, 0x0F Start, 0xFF Unknown
	int Drive_Shift_Target;			//シフト指令値 0x00 B, 0x10 D, 0x20 N, 0x40 R, 0x80 P, 0x0F Start, 0xFF Unknown
	int Drive_Shift_Actual;			//シフト現在値 0x00 B, 0x10 D, 0x20 N, 0x40 R, 0x80 P, 0x0F Start, 0xFF Unknown
	int Drive_Speed_Target;			//速度指令値 0〜18000 (0〜180[km/h])
	int Drive_Speed_Actual;			//速度現在値 0〜18000 (0〜180[km/h])
	int Drive_Pedal_Raw1;			//アクセルストロークセンサ VPA1 [mV]
	int Drive_Pedal_Raw2;			//アクセルストロークセンサ VPA2 [mV]
	int Drive_Shift_Raw1;			//VSX1 [mV]
	int Drive_Shift_Raw2;			//VSX2 [mV]
	int Drive_Shift_Raw3;			//VSX3 [mV]
	int Drive_Shift_Raw4;			//VSX4 [mV]
	int Steer_Mode_Drive;			//0x00 マニュアルモード, 0x10 プログラムモード
	int Steer_Mode_Cont;			//0x00 トルク制御, 0x10 角度制御
	int Steer_Mode_Override;		//0x00 オーバーライドEnable, 0x10 オーバーライドDisable
	int Steer_Mode_Servo;			//0x00 サーボOFF, 0x10 サーボON
	int Steer_Angle_Target;			//角度指令値 -6660〜+6660 (-666°〜 +666°) 左がプラス
	int Steer_Angle_Actual;			//角度現在値 -6660〜+6660 (-666°〜 +666°) 左がプラス
	int Steer_Torque_Target;		//トルク指令値 -4096〜4095 (-1.0〜1.0) 左がプラス
	int Steer_Torque_Actual;		//トルク現在値 -4096〜4095 (-1.0〜1.0) 左がプラス
	int Steer_Torque_Raw1;			//TRQ1 [mV]
	int Steer_Torque_Raw2;			//TRQ2 [mV]
	int Brake_Pedal_Input;			//ブレーキ入力値 0〜4095 (0〜1.0)
	int Brake_Pedal_Target;			//ブレーキ指令値 0〜4095 (0〜1.0)
	int Brake_Pedal_Actual;			//ブレーキ現在値 0〜4095 (0〜1.0)
	int Brake_Pedal_SKS1;			//SKS1 [mV]
	int Brake_Pedal_SKS2;			//SKS2 [mV]
	int Brake_Pedal_PMC1;			//PMC1 [mV]
	int Brake_Pedal_PMC2;			//PMC2 [mV]
	int Brake_Pedal_PRL;			//PRL [mV]
	int Brake_Pedal_PFL;			//PFL [mV]
	int Brake_Pedal_PRR;			//PRR [mV]
	int Brake_Pedal_PFR;			//PFR [mV]
	int Common_Echo_Controller;		//コントローラ種別
	int Common_Echo_No;				//番号
	int Common_Config_Index;		//開始Index
	int Common_Config_Value1;		//値1
